{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# WP1 - Anomaly detection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import py2neo\n",
    "import networkx as nx\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "from statsmodels.tsa.stattools import grangercausalitytests"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = py2neo.Graph(\"bolt://phoenix:7687\", auth=(\"neo4j\", \"\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_rel = graph.relationships.match().all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Calculate granger causality on dataset and update graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "carts front-end\n",
      "not causal\n",
      "user user-db\n",
      "causal\n",
      "user front-end\n",
      "not causal\n",
      "catalogue front-end\n",
      "not causal\n",
      "catalogue-db catalogue\n",
      "not causal\n",
      "orders-db orders\n",
      "causal\n",
      "carts-db carts\n",
      "causal\n",
      "orders shipping\n",
      "causal\n",
      "orders front-end\n",
      "not causal\n",
      "shipping queue-master\n",
      "causal\n"
     ]
    }
   ],
   "source": [
    "MAXLAG = 2\n",
    "f = '../data/loadtest-Updated.csv'\n",
    "P = pd.read_csv(f).sort_values(by=['Time', 'Unnamed: 0'])\n",
    "\n",
    "#perform Granger-Causality test\n",
    "for rel in graph_rel:\n",
    "    source = rel.start_node['id']\n",
    "    target = rel.end_node['id']\n",
    "    if source in P.columns and target in P.columns:\n",
    "        gc_dicts = grangercausalitytests(P[[source, target]], MAXLAG, verbose=False)\n",
    "        p_values = [lag_result[0]['ssr_ftest'][1] for lag_result in gc_dicts.values()]\n",
    "        print(source, target)\n",
    "        if np.min(p_values) < 0.05:\n",
    "            print('causal')\n",
    "            rel[\"causal\"] = True\n",
    "            graph.push(rel)\n",
    "        else:\n",
    "            print('not causal')\n",
    "            rel[\"causal\"] = False\n",
    "            graph.push(rel)\n",
    "           "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "neighbor_q = '''MATCH (a)-[r]-(b) where a.id='worker1' RETURN b'''\n",
    "worker_neighbors = [i.get('b') for i in graph.run(neighbor_q).data()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "rabbitmq queue-master\n",
      "causal\n",
      "rabbitmq shipping\n",
      "causal\n",
      "rabbitmq catalogue-db\n",
      "not causal\n",
      "rabbitmq catalogue\n",
      "causal\n",
      "rabbitmq user\n",
      "causal\n",
      "rabbitmq carts\n",
      "causal\n",
      "rabbitmq payment\n",
      "causal\n",
      "rabbitmq orders\n",
      "causal\n",
      "queue-master rabbitmq\n",
      "causal\n",
      "queue-master shipping\n",
      "causal\n",
      "queue-master catalogue-db\n",
      "not causal\n",
      "queue-master catalogue\n",
      "causal\n",
      "queue-master user\n",
      "not causal\n",
      "queue-master carts\n",
      "not causal\n",
      "queue-master payment\n",
      "not causal\n",
      "queue-master orders\n",
      "causal\n",
      "shipping rabbitmq\n",
      "causal\n",
      "shipping queue-master\n",
      "causal\n",
      "shipping catalogue-db\n",
      "causal\n",
      "shipping catalogue\n",
      "not causal\n",
      "shipping user\n",
      "not causal\n",
      "shipping carts\n",
      "causal\n",
      "shipping payment\n",
      "not causal\n",
      "shipping orders\n",
      "causal\n",
      "catalogue-db rabbitmq\n",
      "not causal\n",
      "catalogue-db queue-master\n",
      "causal\n",
      "catalogue-db shipping\n",
      "not causal\n",
      "catalogue-db catalogue\n",
      "not causal\n",
      "catalogue-db user\n",
      "causal\n",
      "catalogue-db carts\n",
      "causal\n",
      "catalogue-db payment\n",
      "not causal\n",
      "catalogue-db orders\n",
      "not causal\n",
      "catalogue rabbitmq\n",
      "not causal\n",
      "catalogue queue-master\n",
      "causal\n",
      "catalogue shipping\n",
      "not causal\n",
      "catalogue catalogue-db\n",
      "not causal\n",
      "catalogue user\n",
      "causal\n",
      "catalogue carts\n",
      "not causal\n",
      "catalogue payment\n",
      "causal\n",
      "catalogue orders\n",
      "not causal\n",
      "user rabbitmq\n",
      "not causal\n",
      "user queue-master\n",
      "causal\n",
      "user shipping\n",
      "causal\n",
      "user catalogue-db\n",
      "causal\n",
      "user catalogue\n",
      "causal\n",
      "user carts\n",
      "causal\n",
      "user payment\n",
      "causal\n",
      "user orders\n",
      "causal\n",
      "carts rabbitmq\n",
      "causal\n",
      "carts queue-master\n",
      "causal\n",
      "carts shipping\n",
      "causal\n",
      "carts catalogue-db\n",
      "not causal\n",
      "carts catalogue\n",
      "not causal\n",
      "carts user\n",
      "not causal\n",
      "carts payment\n",
      "not causal\n",
      "carts orders\n",
      "causal\n",
      "payment rabbitmq\n",
      "causal\n",
      "payment queue-master\n",
      "not causal\n",
      "payment shipping\n",
      "not causal\n",
      "payment catalogue-db\n",
      "not causal\n",
      "payment catalogue\n",
      "causal\n",
      "payment user\n",
      "causal\n",
      "payment carts\n",
      "not causal\n",
      "payment orders\n",
      "not causal\n",
      "orders rabbitmq\n",
      "causal\n",
      "orders queue-master\n",
      "causal\n",
      "orders shipping\n",
      "causal\n",
      "orders catalogue-db\n",
      "causal\n",
      "orders catalogue\n",
      "causal\n",
      "orders user\n",
      "causal\n",
      "orders carts\n",
      "causal\n",
      "orders payment\n",
      "not causal\n"
     ]
    }
   ],
   "source": [
    "for n1 in worker_neighbors:\n",
    "    for n2 in worker_neighbors:\n",
    "        source = n1['id']\n",
    "        target = n2['id']\n",
    "        if source == target:\n",
    "            continue\n",
    "        if source in P.columns and target in P.columns:\n",
    "            gc_dicts = grangercausalitytests(P[[source, target]], MAXLAG, verbose=False)\n",
    "            p_values = [lag_result[0]['ssr_ftest'][1] for lag_result in gc_dicts.values()]\n",
    "            print(source, target)\n",
    "            if np.min(p_values) < 0.05:\n",
    "                print('causal')\n",
    "            else:\n",
    "                print('not causal')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.9.0 ('graphs_ml')",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "d29e24484652cf81adbd39cba5ca18d14ce256afd8a74e36b8d095905f91e803"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
